# Pandas Review

### Basic DataFrame Manipulation
    1) pd.Series
    2) df = pd.DataFrame(df)
    3) df = df.rename(columns={:})

In [1]:
# pd.Series(["","",...]) will create a column of object

import pandas as pd
data_series = pd.Series(["UCLA", "UC Berkeley", "UC Irvine", "University of Central Florida", "Rutgers University"])
data_series

0                             UCLA
1                      UC Berkeley
2                        UC Irvine
3    University of Central Florida
4               Rutgers University
dtype: object

In [2]:
# pd.DataFrame() will convert a list into a dataframe with column name of 0

data_series = pd.DataFrame(data_series)
data_series

                               0
0                           UCLA
1                    UC Berkeley
2                      UC Irvine
3  University of Central Florida
4             Rutgers University

In [3]:
# rename column using df.rename(columns={"oldname":"newname", "":"",...})

data_series = data_series.rename(columns={0:"University Name"})
data_series

                 University Name
0                           UCLA
1                    UC Berkeley
2                      UC Irvine
3  University of Central Florida
4             Rutgers University

### Creating DataFrame Methods
    1) Row by Row
    2) Column by Column

In [17]:
# Row by Row using df = pd.Dataframe([{"":"","":""},{"":"","":""},...])

# Method 01

DF = [{"Frame":"","Price":"","Sales":""}, \
      {"Frame":"","Price":"","Sales":""}]
dfp = pd.DataFrame(DF)
#DF
#dfp

# Method 02

DF2 = pd.DataFrame([{"Frame":"","Price":"","Sales":""}, \
                   {"Frame":"","Price":"","Sales":""}])
#DF2

In [23]:
# Column by Column using df = pd.DataFrame({"":["","",...],"":["","",...]})

# Method 01
DF = {
    "Painting": ["","","","",""],
    "Price": ["","","","",""],
    "Popularity": ["","","","",""],
    }
dfp = pd.DataFrame(DF)
#DF
#dfp

# Method 02
DF = pd.DataFrame({
    "Painting": ["","","","",""],
    "Price": ["","","","",""],
    "Popularity": ["","","","",""],
    })
#DF

### Pandas Methods, Methods are usually denoted with .Method()
    1) .head() print the first 5 rows
    2) .tail() print the last 5 rows
    3) .describe() generates statistics such as mean, std, min, max etc.
    4) .unique() find unique values in a column
    5) .value_counts() returns object containing counts of unique values
    6) .mean() find the average of a column
    7) .sum() find the sum of a column
    8) .set_index("") will set index to values in that column Header
    9) df = df.rename(columns={:,"":"",...}) will rename a column Header
    10) df[""] = variable will add a column to the DataFrame using 
    11) df = df[["","",...]] can arrange column based on users preference

In [40]:
training_data = pd.DataFrame({
    "Name":["Gino Walker","Hiedi Wasser","Kerrie Wetzel","Elizabeth Sackett","Jack Mitten","Madalene Wayman","Jamee Horvath","Arlena Reddin","Tula Levan","Teisha Dreier","Leslie Carrier","Arlette Hartson","Romana Merkle","Heath Viviani","Andres Zimmer","Allyson Osman","Yadira Caggiano","Jeanmarie Friedrichs","Leann Ussery","Bee Mom","Pandora Charland","Karena Wooten","Elizabet Albanese","Augusta Borjas","Erma Yadon","Belia Lenser","Karmen Sancho","Edison Mannion","Sonja Hornsby","Morgan Frei","Florencio Murphy","Christoper Hertel","Thalia Stepney","Tarah Argento","Nicol Canfield","Pok Moretti","Barbera Stallings","Muoi Kelso","Cicely Ritz","Sid Demelo","Eura Langan","Vanita An","Frieda Fuhr","Ernest Fitzhenry","Ashlyn Tash","Melodi Mclendon","Rochell Leblanc","Jacqui Reasons","Freeda Mccroy","Vanna Runk","Florinda Milot","Cierra Lecompte","Nancey Kysar","Latasha Dalton","Charlyn Rinaldi","Erline Averett","Mariko Hillary","Rosalyn Trigg","Sherwood Brauer","Hortencia Olesen","Delana Kohut","Geoffrey Mcdade","Iona Delancey","Donnie Read","Cesar Bhatia","Evia Slate","Kaye Hugo","Denise Vento","Lang Kittle","Sherry Whittenberg","Jodi Bracero","Tamera Linneman","Katheryn Koelling","Tonia Shorty","Misha Baxley","Lisbeth Goering","Merle Ladwig","Tammie Omar","Jesusa Avilla","Alda Zabala","Junita Dogan","Jessia Anglin","Peggie Scranton","Dania Clodfelter","Janis Mccarthy","Edmund Galusha","Tonisha Posey","Arvilla Medley","Briana Barbour","Delfina Kiger","Nia Lenig","Ricarda Bulow","Odell Carson","Nydia Clonts","Andree Resendez","Daniela Puma","Sherill Paavola","Gilbert Bloomquist","Shanon Mach","Justin Bangert","Arden Hokanson","Evelyne Bridge","Hee Simek","Ward Deangelis","Jodie Childs","Janis Boehme","Beaulah Glowacki","Denver Stoneham","Tarra Vinton","Deborah Hummell","Ulysses Neil","Kathryn Marques","Rosanna Dake","Gavin Wheat","Tameka Stoke","Janella Clear","Kaye Ciriaco","Suk Bloxham","Gracia Whaley","Philomena Hemingway","Claudette Vaillancourt","Olevia Piche","Trey Chiles","Idalia Scardina","Jenine Tremble","Herbert Krider","Alycia Schrock","Miss Weibel","Pearlene Neidert","Kina Callender","Charlotte Skelley","Theodora Harrigan","Sydney Shreffler","Annamae Trinidad","Tobi Mumme","Rosia Elliot","Debbra Putt","Rena Delosantos","Genna Grennan","Nieves Huf","Berry Lugo","Ayana Verdugo","Joaquin Mazzei","Doris Harmon","Patience Poss","Magaret Zabel","Marylynn Hinojos","Earlene Marcantel","Yuki Evensen","Rema Gay","Delana Haak","Patricia Fetters","Vinnie Elrod","Octavia Bellew","Burma Revard","Lakenya Kato","Vinita Buchner","Sierra Margulies","Shae Funderburg","Jenae Groleau","Louetta Howie","Astrid Duffer","Caron Altizer","Kymberly Amavisca","Mohammad Diedrich","Thora Wrinkle","Bethel Wiemann","Patria Millet","Eldridge Burbach","Alyson Eddie","Zula Hanna","Devin Goodwin","Felipa Kirkwood","Kurtis Kempf","Kasey Lenart","Deena Blankenship","Kandra Wargo","Sherrie Cieslak","Ron Atha","Reggie Barreiro","Daria Saulter","Tandra Eastman","Donnell Lucious","Talisha Rosner","Emiko Bergh","Terresa Launius","Margy Hoobler","Marylou Stelling","Lavonne Justice","Kala Langstaff","China Truett","Louanne Dussault","Thomasena Samaniego","Charlesetta Tarbell","Fatimah Lade","Malisa Cantero","Florencia Litten","Francina Fraise","Patsy London","Deloris Mclaughlin"],
    "Trainer":['Bettyann Savory','Mariah Barberio','Gordon Perrine','Pa Dargan','Blanch Victoria','Aldo Byler','Aldo Byler','Williams Camire','Junie Ritenour','Gordon Perrine','Bettyann Savory','Mariah Barberio','Aldo Byler','Barton Stecklein','Bettyann Savory','Barton Stecklein','Gordon Perrine','Pa Dargan','Aldo Byler','Brittani Brin','Bettyann Savory','Phyliss Houk','Bettyann Savory','Junie Ritenour','Aldo Byler','Calvin North','Brittani Brin','Junie Ritenour','Blanch Victoria','Brittani Brin','Bettyann Savory','Blanch Victoria','Mariah Barberio','Bettyann Savory','Blanch Victoria','Brittani Brin','Junie Ritenour','Pa Dargan','Gordon Perrine','Phyliss Houk','Pa Dargan','Mariah Barberio','Phyliss Houk','Phyliss Houk','Calvin North','Williams Camire','Brittani Brin','Gordon Perrine','Bettyann Savory','Bettyann Savory','Pa Dargan','Phyliss Houk','Barton Stecklein','Blanch Victoria','Coleman Dunmire','Phyliss Houk','Blanch Victoria','Pa Dargan','Harland Coolidge','Calvin North','Bettyann Savory','Phyliss Houk','Bettyann Savory','Harland Coolidge','Gordon Perrine','Junie Ritenour','Harland Coolidge','Blanch Victoria','Mariah Barberio','Coleman Dunmire','Aldo Byler','Bettyann Savory','Gordon Perrine','Bettyann Savory','Barton Stecklein','Harland Coolidge','Aldo Byler','Aldo Byler','Pa Dargan','Junie Ritenour','Brittani Brin','Junie Ritenour','Gordon Perrine','Mariah Barberio','Mariah Barberio','Mariah Barberio','Bettyann Savory','Brittani Brin','Aldo Byler','Phyliss Houk','Blanch Victoria','Pa Dargan','Phyliss Houk','Brittani Brin','Barton Stecklein','Coleman Dunmire','Bettyann Savory','Bettyann Savory','Gordon Perrine','Blanch Victoria','Junie Ritenour','Phyliss Houk','Coleman Dunmire','Williams Camire','Harland Coolidge','Williams Camire','Aldo Byler','Harland Coolidge','Gordon Perrine','Brittani Brin','Coleman Dunmire','Calvin North','Phyliss Houk','Brittani Brin','Aldo Byler','Bettyann Savory','Brittani Brin','Gordon Perrine','Calvin North','Harland Coolidge','Coleman Dunmire','Harland Coolidge','Aldo Byler','Junie Ritenour','Blanch Victoria','Harland Coolidge','Blanch Victoria','Junie Ritenour','Harland Coolidge','Junie Ritenour','Gordon Perrine','Brittani Brin','Coleman Dunmire','Williams Camire','Junie Ritenour','Brittani Brin','Calvin North','Barton Stecklein','Barton Stecklein','Mariah Barberio','Coleman Dunmire','Bettyann Savory','Mariah Barberio','Pa Dargan','Barton Stecklein','Coleman Dunmire','Brittani Brin','Barton Stecklein','Pa Dargan','Barton Stecklein','Junie Ritenour','Bettyann Savory','Williams Camire','Pa Dargan','Calvin North','Williams Camire','Coleman Dunmire','Aldo Byler','Barton Stecklein','Coleman Dunmire','Blanch Victoria','Mariah Barberio','Mariah Barberio','Harland Coolidge','Barton Stecklein','Phyliss Houk','Pa Dargan','Bettyann Savory','Barton Stecklein','Harland Coolidge','Junie Ritenour','Pa Dargan','Mariah Barberio','Blanch Victoria','Williams Camire','Phyliss Houk','Phyliss Houk','Coleman Dunmire','Mariah Barberio','Gordon Perrine','Coleman Dunmire','Brittani Brin','Pa Dargan','Coleman Dunmire','Brittani Brin','Blanch Victoria','Coleman Dunmire','Gordon Perrine','Coleman Dunmire','Aldo Byler','Aldo Byler','Mariah Barberio','Williams Camire','Phyliss Houk','Aldo Byler','Williams Camire','Aldo Byler','Williams Camire','Coleman Dunmire','Phyliss Houk'],
    "Weight":[128,180,193,177,237,166,224,208,177,241,114,161,162,151,220,142,193,193,124,130,132,141,190,239,213,131,172,127,184,157,215,122,181,240,218,205,239,217,234,158,180,131,194,171,177,110,117,114,217,123,248,189,198,127,182,121,224,111,151,170,188,150,137,231,222,186,139,175,178,246,150,154,129,216,144,198,228,183,173,129,157,199,186,232,172,157,246,239,214,161,132,208,187,224,164,177,175,224,219,235,112,241,243,179,208,196,131,207,182,233,191,162,173,197,190,182,231,196,196,143,250,174,138,135,164,204,235,192,114,179,215,127,185,213,250,213,153,217,176,190,119,167,118,208,113,206,200,236,159,218,168,159,156,183,121,203,215,209,179,219,174,220,129,188,217,250,166,157,112,236,182,144,189,243,238,147,165,115,160,134,245,174,238,157,150,184,174,134,134,248,199,165,117,119,162,112,170,224,247,217],
    "Membership (Days)":[52,70,148,124,186,157,127,155,37,185,158,129,93,69,124,13,76,153,164,161,48,121,167,69,39,163,7,34,176,169,108,162,195,86,155,77,197,200,80,142,179,67,58,145,188,147,125,15,13,173,125,4,61,29,132,110,62,137,197,135,162,174,32,151,149,65,18,42,63,62,104,200,189,40,38,199,1,12,8,2,195,30,7,72,130,144,2,34,200,143,43,196,22,115,171,54,143,59,14,52,109,115,187,185,26,19,178,18,120,169,45,52,130,69,168,178,96,22,78,152,39,51,118,130,60,156,108,69,103,158,165,142,86,91,117,77,57,169,86,188,97,111,22,83,81,177,163,35,12,164,21,181,171,138,22,107,58,51,38,128,19,193,157,13,104,89,13,10,26,190,179,101,7,159,100,49,120,109,56,199,51,108,47,171,69,162,74,119,148,88,32,159,65,146,140,171,88,18,59,13]
                            })
training_data.head(10)

                Name          Trainer  Weight  Membership (Days)
0        Gino Walker  Bettyann Savory     128                 52
1       Hiedi Wasser  Mariah Barberio     180                 70
2      Kerrie Wetzel   Gordon Perrine     193                148
3  Elizabeth Sackett        Pa Dargan     177                124
4        Jack Mitten  Blanch Victoria     237                186
5    Madalene Wayman       Aldo Byler     166                157
6      Jamee Horvath       Aldo Byler     224                127
7      Arlena Reddin  Williams Camire     208                155
8         Tula Levan   Junie Ritenour     177                 37
9      Teisha Dreier   Gordon Perrine     241                185

In [41]:
training_data.describe()

           Weight  Membership (Days)
count  200.000000         200.000000
mean   180.820000         101.910000
std     39.372689          60.162025
min    110.000000           1.000000
25%    151.000000          51.000000
50%    180.500000         105.500000
75%    215.000000         157.250000
max    250.000000         200.000000

In [42]:
# Find the names of the trainers

training_data["Trainer"].unique()

array(['Bettyann Savory', 'Mariah Barberio', 'Gordon Perrine',
       'Pa Dargan', 'Blanch Victoria', 'Aldo Byler', 'Williams Camire',
       'Junie Ritenour', 'Barton Stecklein', 'Brittani Brin',
       'Phyliss Houk', 'Calvin North', 'Coleman Dunmire',
       'Harland Coolidge'], dtype=object)

In [43]:
# Find how many students each trainer has

training_data["Trainer"].value_counts()

Bettyann Savory     20
Aldo Byler          17
Coleman Dunmire     17
Phyliss Houk        16
Brittani Brin       16
Mariah Barberio     15
Pa Dargan           14
Junie Ritenour      14
Blanch Victoria     14
Gordon Perrine      14
Barton Stecklein    13
Harland Coolidge    12
Williams Camire     11
Calvin North         7
Name: Trainer, dtype: int64

In [44]:
# Find the avg weight of all students

training_data["Weight"].mean()

180.82

In [45]:
# Find the combined weight of all students

training_data["Weight"].sum()

36164

In [46]:
# Converting the membership days into weeks

weeks = training_data["Membership (Days)"]/7

In [47]:
# Add a column to the DataFrame

training_data["Membership (Weeks)"] = weeks

training_data.head()

,Name,Trainer,Weight,Membership (Days),Membership (Weeks)
0,Gino Walker,Bettyann Savory,128,52,7.428571
1,Hiedi Wasser,Mariah Barberio,180,70,10.000000
2,Kerrie Wetzel,Gordon Perrine,193,148,21.142857
3,Elizabeth Sackett,Pa Dargan,177,124,17.714286
4,Jack Mitten,Blanch Victoria,237,186,26.571429

### Pandas Combining Methods with other commands
    1) Combining .unique() with len
        * df = len(df[""].unique())
    2) Adding column values
        * df = df[""].sum() + df[""].sum() + ...

### Pandas extract sub dataframe within main dataframe
    1) Logic Test returns a series of booleans df = df[""] == ""
    2) df.loc[] will access a group of rows and columns by label(s) or a boolean array
    3) df.iloc[] is primarily integer position based (from 0 to length-1 of the axis), 
       but may also be used with a boolean array.
    4) Conditionals using df = df.loc[df[""] == "", :]
    5) Can widen .loc by adding more conditions using |
        * df.loc[(df[""] == "") | (df[""] == ""), :]
    6) Conditionals using .iloc[]

In [67]:
file = "Week_04_Pandas_CSV_XLSX/sampleData.csv"
df_original = pd.read_csv(file)
#df_original.head()

# Logic test to find Peter in "first_name" column

Peter = df_original["first_name"] == "Peter"
Peter.head()

0     True
1    False
2    False
3    False
4    False
Name: first_name, dtype: bool

In [59]:
# Grab the first 5 rows of data and columns from "first_name" to "Phone Number"
# using .loc[[],[]]

richardson_to_morales = df_original.loc[[0,1,2,3,4],["last_name","first_name","Phone Number"]]
richardson_to_morales

    last_name first_name       Phone Number
0  Richardson      Peter    7-(789)867-9023
1       Berry     Janice   86-(614)973-1727
2      Hudson     Andrea   86-(918)527-6371
3    Mcdonald     Arthur  420-(553)779-7783
4     Morales      Kathy  351-(720)541-2124

In [62]:
# Do the above using .iloc[:,:]

richardson_to_morales_iloc = df_original.iloc[0:4, 1:4]
richardson_to_morales_iloc

  first_name   last_name       Phone Number
0      Peter  Richardson    7-(789)867-9023
1     Janice       Berry   86-(614)973-1727
2     Andrea      Hudson   86-(918)527-6371
3     Arthur    Mcdonald  420-(553)779-7783

In [70]:
# Conditionals using .loc[] to find all "Billy" in "first_name" column

only_billys = df_original.loc[df_original["first_name"] == "Billy", :]
print(only_billys)

    id first_name last_name      Phone Number       Time zone
19  20      Billy     Clark  62-(213)345-2549   Asia/Makassar
22  23      Billy   Andrews  86-(859)746-5367  Asia/Chongqing
58  59      Billy     Price  86-(878)547-7739   Asia/Shanghai

In [72]:
# Conditionals using .loc[] to find all "Billy" and "Peter" in "first_name" column

billy_peter = df_original.loc[(df_original["first_name"] == "Billy") | \
                             (df_original["first_name"] == "Peter"),:]
billy_peter

    id first_name   last_name      Phone Number       Time zone
0    1      Peter  Richardson   7-(789)867-9023   Europe/Moscow
19  20      Billy       Clark  62-(213)345-2549   Asia/Makassar
22  23      Billy     Andrews  86-(859)746-5367  Asia/Chongqing
58  59      Billy       Price  86-(878)547-7739   Asia/Shanghai

### Using 
    1) .columns will list all the column Header
    2) del df[""] will delete a column
    3) df.count() will count the number of items in each column with in the df
    4) df = df.dropna(how="any") will drop any rows with missing information
    5) df.dtypes will identify column data type
    6) df[""].head() will list the first 5 values of the selected column
    7) df.dtypes will list the series type
    8) df[""].value_counts() will count number of values in a category

In [75]:
movie_file = "Week_04_Pandas_CSV_XLSX/movie_scores.csv"
movie_file_pd = pd.read_csv(movie_file)
#movie_file_pd.head()
movie_file_pd.columns

Index(['FILM', 'RottenTomatoes', 'RottenTomatoes_User', 'Metacritic',
       'Metacritic_User', 'IMDB', 'Fandango_Stars', 'Fandango_Ratingvalue',
       'RT_norm', 'RT_user_norm', 'Metacritic_norm', 'Metacritic_user_nom',
       'IMDB_norm', 'RT_norm_round', 'RT_user_norm_round',
       'Metacritic_norm_round', 'Metacritic_user_norm_round',
       'IMDB_norm_round', 'Metacritic_user_vote_count', 'IMDB_user_vote_count',
       'Fandango_votes', 'Fandango_Difference'],
      dtype='object')

In [97]:
# Using conditionals to find movie scores above 7 in IMDB
# the ["","",...] after > 7, will list values in those columns

above_7 = movie_file_pd.loc[movie_file_pd["IMDB"] > 7, ["FILM","IMDB","IMDB_user_vote_count"]]
above_7.head()

                             FILM  IMDB  IMDB_user_vote_count
0  Avengers: Age of Ultron (2015)   7.8                271107
1               Cinderella (2015)   7.1                 65709
2                  Ant-Man (2015)   7.8                103660
5        The Water Diviner (2015)   7.2                 39373
8    Shaun the Sheep Movie (2015)   7.4                 12227

In [105]:
file = "Week_04_Pandas_CSV_XLSX/donors2008.csv"
donors08_df = pd.read_csv(file, encoding="ISO-8859-1")
donors08_df.head()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

In [106]:
del donors08_df["FIELD8"]
donors08_df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [107]:
donors08_df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
dtype: int64

In [109]:
# Drop all rows with missing information using df.dropna(how="any")

donors08_df = donors08_df.dropna(how="any")
donors08_df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

In [112]:
donors08_df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object